InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыУстановокЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыУстановокЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<BasedOn>
				<xr:Item>Document.ПриобретениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ПорчаТоваров</xr:Item>
				<xr:Item>Document.СборкаТоваров</xr:Item>
				<xr:Item>Document.ПрочееОприходованиеТоваров</xr:Item>
				<xr:Item>Document.ИзменениеАссортимента</xr:Item>
				<xr:Item>Document.ПриемкаТоваровНаХранение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУстановокЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИзмененаВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиКомпоновкиДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаспространениеЦенСервер_SCT/Ext/Module.bsl
#Если Сервер Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обработчик подписки на ПриЗаписи Справочник.ХарактеристикиНоменклатуры.
// Запускает фоновое задание распространения цен с эталонной характеристики
// (доп. реквизит из Константы.ДопРеквизитЕстьПокраска_SCT, значение = ЛОЖЬ)
// на новую характеристику того же ВидаНоменклатуры.
//
// Параметры:
//	Источник - СправочникОбъект.ХарактеристикиНоменклатуры - записываемый элемент
//	Отказ    - Булево - стандартный параметр события (не модифицируем)
//
Процедура ПриЗаписиХарактеристикиНоменклатуры(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если Источник.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	// Распространение работает только для общих характеристик ВидаНоменклатуры
	Если ТипЗнч(Источник.Владелец) <> Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
	// Фича отключена, если константа не настроена администратором
	Если НЕ ЗначениеЗаполнено(Константы.ДопРеквизитЕстьПокраска_SCT.Получить()) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Источник.Ссылка);
	ИмяЗадания = НСтр("ru='Распространение цен по характеристике ';uk='Розповсюдження цін за характеристикою '")
		+ Строка(Источник.Наименование);

	Попытка
		ФоновыеЗадания.Выполнить(
			"РаспространениеЦенСервер_SCT.ВыполнитьВФоне",
			ПараметрыЗадания,
			,
			ИмяЗадания);
	Исключение
		ЗаписьЖурналаРегистрации(
			"Schueco.РаспространениеЦен",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ХарактеристикиНоменклатуры,
			Источник.Ссылка,
			НСтр("ru='Не удалось поставить фоновое задание: ';uk='Не вдалося поставити фонове завдання: '")
				+ ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Точка входа фонового задания. Распространяет цены с эталонной характеристики
// того же ВидаНоменклатуры на переданную характеристику для всех ВидовЦен,
// в которых у эталонной характеристики есть актуальные записи.
//
// Параметры:
//	Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//
Процедура ВыполнитьВФоне(Характеристика) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	// Защита от старта с уже невалидной ссылкой (откат внешней транзакции записи)
	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
		Возврат;
	КонецЕсли;
	Если Характеристика.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	ДопРеквизит = Константы.ДопРеквизитЕстьПокраска_SCT.Получить();
	Если НЕ ЗначениеЗаполнено(ДопРеквизит) Тогда
		Возврат;
	КонецЕсли;

	// 1. Защита: эта характеристика — НЕ сама эталонная (значение доп.реквизита = ЛОЖЬ)
	ЗапросЭталонностиСамой = Новый Запрос;
	ЗапросЭталонностиСамой.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Признак
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДопРекв
		|ГДЕ
		|	ДопРекв.Ссылка = &Характеристика
		|	И ДопРекв.Свойство = &Свойство
		|	И ДопРекв.Значение = ЛОЖЬ";
	ЗапросЭталонностиСамой.УстановитьПараметр("Характеристика", Характеристика);
	ЗапросЭталонностиСамой.УстановитьПараметр("Свойство", ДопРеквизит);
	Если НЕ ЗапросЭталонностиСамой.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	// 2. Определить ВидНоменклатуры
	ВидНоменклатуры = Неопределено;
	Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Характеристика, "Владелец");
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры") Тогда
		ВидНоменклатуры = Владелец;
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ВидНоменклатуры");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		ЗаписьЖурналаРегистрации(
			"Schueco.РаспространениеЦен",
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.ХарактеристикиНоменклатуры,
			Характеристика,
			НСтр("ru='Не определён Вид номенклатуры — распространение пропущено.';uk='Не визначено Вид номенклатури — розповсюдження пропущено.'"));
		Возврат;
	КонецЕсли;

	// 3. Эталонная характеристика того же ВидаНоменклатуры
	ЗапросЭталон = Новый Запрос;
	ЗапросЭталон.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Хар.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДопРекв
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК Хар
		|		ПО ДопРекв.Ссылка = Хар.Ссылка
		|ГДЕ
		|	Хар.Владелец = &ВидНоменклатуры
		|	И НЕ Хар.ПометкаУдаления
		|	И ДопРекв.Свойство = &Свойство
		|	И ДопРекв.Значение = ЛОЖЬ";
	ЗапросЭталон.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	ЗапросЭталон.УстановитьПараметр("Свойство", ДопРеквизит);
	ВыборкаЭталона = ЗапросЭталон.Выполнить().Выбрать();
	Если НЕ ВыборкаЭталона.Следующий() Тогда
		ЗаписьЖурналаРегистрации(
			"Schueco.РаспространениеЦен",
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.ХарактеристикиНоменклатуры,
			Характеристика,
			НСтр("ru='Не найдена эталонная характеристика для Вида ';uk='Не знайдено еталонну характеристику для Виду '")
				+ Строка(ВидНоменклатуры));
		Возврат;
	КонецЕсли;
	ЭталоннаяХарактеристика = ВыборкаЭталона.Ссылка;

	// 4. Срез цен эталонной характеристики, исключая пары (Номенклатура × ВидЦены),
	//    для которых у нашей характеристики уже есть запись (ручная установка
	//    или предыдущее частичное распространение). Так одна ручная цена не блокирует
	//    распространение для остальных номенклатур того же вида.
	ЗапросСреза = Новый Запрос;
	ЗапросСреза.Текст =
		"ВЫБРАТЬ
		|	Эталон.Период       КАК Период,
		|	Эталон.Номенклатура КАК Номенклатура,
		|	Эталон.ВидЦены      КАК ВидЦены,
		|	Эталон.Упаковка     КАК Упаковка,
		|	Эталон.Цена         КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, Характеристика = &ЭталоннаяХарактеристика) КАК Эталон
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекДата, Характеристика = &Характеристика) КАК Цель
		|		ПО Цель.Номенклатура = Эталон.Номенклатура
		|		И Цель.ВидЦены = Эталон.ВидЦены
		|ГДЕ
		|	Эталон.Цена > 0
		|	И Цель.Номенклатура ЕСТЬ NULL
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ВидЦены,
		|	Номенклатура";
	ЗапросСреза.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	ЗапросСреза.УстановитьПараметр("ЭталоннаяХарактеристика", ЭталоннаяХарактеристика);
	ЗапросСреза.УстановитьПараметр("Характеристика", Характеристика);
	ТаблицаЦен = ЗапросСреза.Выполнить().Выгрузить();

	Если ТаблицаЦен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// 5. Группировка по (Период, ВидЦены) — один документ на группу
	Группы = ТаблицаЦен.Скопировать(, "Период,ВидЦены");
	Группы.Свернуть("Период,ВидЦены");

	СозданоДокументов = 0;
	СозданоСтрок = 0;

	Для Каждого Группа Из Группы Цикл
		Отбор = Новый Структура("Период,ВидЦены", Группа.Период, Группа.ВидЦены);
		СтрокиГруппы = ТаблицаЦен.НайтиСтроки(Отбор);
		Если СтрокиГруппы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		НачатьТранзакцию();
		Попытка
			Док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			Док.Дата = Группа.Период;
			Док.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
			Док.Комментарий = НСтр("ru='Schueco: автоматическое распространение цен с эталонной характеристики на ';uk='Schueco: автоматичне розповсюдження цін з еталонної характеристики на '")
				+ Строка(Характеристика);

			СтрВЦ = Док.ВидыЦен.Добавить();
			СтрВЦ.ВидЦены = Группа.ВидЦены;

			Для Каждого СтрокаЦены Из СтрокиГруппы Цикл
				СтрТовары = Док.Товары.Добавить();
				СтрТовары.Номенклатура   = СтрокаЦены.Номенклатура;
				СтрТовары.Характеристика = Характеристика;
				СтрТовары.Упаковка       = СтрокаЦены.Упаковка;
				СтрТовары.ВидЦены        = Группа.ВидЦены;
				СтрТовары.Цена           = СтрокаЦены.Цена;
			КонецЦикла;

			Док.ОбменДанными.Загрузка = Истина;
			Док.Записать(РежимЗаписиДокумента.Запись);
			Док.ОбменДанными.Загрузка = Ложь;
			Док.Записать(РежимЗаписиДокумента.Проведение);

			СозданоДокументов = СозданоДокументов + 1;
			СозданоСтрок      = СозданоСтрок + СтрокиГруппы.Количество();

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				"Schueco.РаспространениеЦен",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.УстановкаЦенНоменклатуры,
				Характеристика,
				НСтр("ru='Ошибка создания документа УстановкаЦенНоменклатуры (Период ';uk='Помилка створення документа УстановкаЦенНоменклатуры (Період '")
					+ Строка(Группа.Период) + ", ВидЦен " + Строка(Группа.ВидЦены) + "): " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;

	ЗаписьЖурналаРегистрации(
		"Schueco.РаспространениеЦен",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Справочники.ХарактеристикиНоменклатуры,
		Характеристика,
		НСтр("ru='Распространение цен завершено. Документов: ';uk='Розповсюдження цін завершено. Документів: '")
			+ СозданоДокументов + ", "
			+ НСтр("ru='строк: ';uk='рядків: '") + СозданоСтрок);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
